# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'antibody'
brew 'awscli'
brew 'bash' # Latest Bash version
cask 'bartender'
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'fzf' # fuzzy finder for command line
brew 'git'
brew 'gnupg2'
brew 'go'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'nodenv'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'zsh'
brew 'zsh-completions'

# Development
# brew 'imagick'
# brew 'mysql'
brew 'nginx'
brew 'rbenv'
brew 'ruby-build'
brew 'redis'

# Apps
cask 'aerial'
cask 'amethyst'
cask 'bettertouchtool'
cask 'alfred'
cask 'caffeine'
cask 'cleanshot'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'google-chrome'
cask 'karabiner-elements'
# cask 'macdown'
# cask 'mysqlworkbench'
cask 'notion'
cask 'obsidian'
cask 'slack'
# cask 'spectacle'
cask 'spotify'
# cask 'tableplus'
# cask 'there'
# # cask 'tor-browser'
# cask 'transmit' # file transfer and management tool
# cask 'vagrant'
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'
cask 'visual-studio-code'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
brew 'svn' # needed for font installation
cask 'font-hack-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas '1Password', id: 1333542190
# mas 'Giphy Capture', id: 668208984
# mas 'Sip', id: 507257563
# mas 'Spark', id: 1176895641
# mas 'The Unarchiver', id: 425424353
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005
# mas 'Unsplash', id: 1284863847
