# Taps
tap 'homebrew/cask-versions'

# Binaries
# brew 'antidote'
brew 'awscli'
brew 'bash' # Latest Bash version
# brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'fzf' # fuzzy finder for command line
brew 'git'
brew 'grep'
# brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
# brew 'trash' # Manage the Trash bin
brew 'zsh'
brew 'zsh-completions'

# Development
# brew 'imagemagick'
brew 'go'
brew 'nodenv'
brew 'rbenv'
brew 'ruby-build'
brew 'redis'

# Apps
cask 'claude'
cask 'claude-code'
cask 'cleanshot'
cask 'codex'
cask 'codex-app'
cask 'cyberduck'
cask 'discord'
cask 'docker'
# cask 'dropbox'
cask 'fantastical'
cask 'figma'
# cask 'google-chrome'
cask 'hyperkey'
cask 'iterm2'
# cask 'notion'
cask 'obsidian'
cask 'raycast'
# cask 'screen-studio'
# cask 'slack'
cask 'spotify'
cask 'tableplus'
# cask 'there' # team member time zone viewer
# cask 'transmit' # file transfer and management tool
cask 'visual-studio-code'

# Fonts
# brew 'svn' # needed for font installation
# cask 'font-hack-nerd-font'
# cask 'font-meslo-lg-nerd-font'
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
# mas '1Password', id: 1333542190
# mas 'Giphy Capture', id: 668208984
# mas 'Sip', id: 507257563
# mas 'Spark', id: 1176895641
# mas 'The Unarchiver', id: 425424353
mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005
# mas 'Unsplash', id: 1284863847
